hanifeee535/FreeRTOS_Project/003_LED_Effect_Using_SW_Timer_and_USART/Drivers/stm32f103Driver.c
}

char USART_receive (uint8_t usart){
	USART_TypeDef *USARTX = select_USART (usart);
	char received_char; // Variable to store the received character
	
	// Wait for the RXNE (Receive Data Register Not Empty) flag to be set
    // RXNE is bit 5 of the Status Register (SR)
    while ((USARTX->SR & (1 << 5)) == 0) {
        // Busy wait until data is ready to be read
    }

    // Read the data from the Data Register (DR)
    received_char = USARTX->DR;

    // Return the received character
    return received_char;
	
}

void USART_transmit(uint8_t usart, char c) {
    USART_TypeDef *USARTX = select_USART(usart);  // Select the appropriate USART instance   
    // Wait for the TXE (Transmit Data Register Empty) flag to be set
    // TXE is bit 7 of the Status Register (SR)
    while ((USARTX->SR & (1 << 7)) == 0) {
        // Busy wait until the transmit buffer is empty
    }

    // Write the character to the Data Register (DR)
    USARTX->DR = c;
}

void USART_send_string(uint8_t usart, const char *str) {
    while (*str) {
        USART_transmit(usart, *str++);
    }
}



void init_usart_receive_interrupt(uint8_t usart, uint32_t baud_rate, uint8_t priority_level) {
    // Initialize USART (enable clock, set GPIO, configure baud rate, enable USART)
		// Select the appropriate USART instance
    USART_TypeDef *USARTX = select_USART(usart);
    init_USART(usart, baud_rate);
    uint32_t irq_number;
	
	__disableinterrupt();
    // Enable RXNEIE (Receive Data Register Not Empty Interrupt Enable)
    USARTX->CR1 |= (1 << 5);

    // Enable the USART interrupt in the NVIC
    if (usart == 1) {
    	irq_number = 37;
        NVIC_ISER1 |= (1 << 5);  // Enable interrupt for USART1
    } else if (usart == 2) {
    	irq_number = 38;
        NVIC_ISER1 |= (1 << 6);  // Enable interrupt for USART2
    } else if (usart == 3) {
    	irq_number = 39;
        NVIC_ISER1 |= (1 << 7);  // Enable interrupt for USART3
    }
    NVIC_SetPriority(irq_number ,priority_level );
	__enableinterrupt();
}

void init_usart_transmit_interrupt(uint8_t usart, uint32_t baud_rate, uint8_t priority_level) {
    // Initialize USART (enable clock, set GPIO, configure baud rate, enable USART)
    USART_TypeDef *USARTX = select_USART(usart);
    init_USART(usart, baud_rate);
    uint32_t irq_number;
    __disableinterrupt();
    // Enable TXEIE (Transmit Data Register Empty Interrupt Enable)
    USARTX->CR1 |= (1 << 7);

    // Enable the USART interrupt in the NVIC
    if (usart == 1) {
    	irq_number = 37;
        NVIC_ISER1 |= (1 << 5);  // Enable interrupt for USART1
    } else if (usart == 2) {
    	irq_number = 38;
        NVIC_ISER1 |= (1 << 6);  // Enable interrupt for USART2
    } else if (usart == 3) {
    	irq_number = 39;
        NVIC_ISER1 |= (1 << 7);  // Enable interrupt for USART3
    }
    NVIC_SetPriority(irq_number ,priority_level );
		__enableinterrupt();
}

	


/*************************************************************************************************/
/*************************__SPI__*************************/
/*************************************************************************************************/

void init_SPI(uint8_t spi, uint32_t  prescaler) {
   
	uint8_t prescaler_bits; // Variable to hold the BR[2:0] value

	RCC->APB2ENR |= (1<<0); 
	// Map the prescaler value to BR[2:0]
switch (prescaler) {
	case 2:
		prescaler_bits = 0b000;
		break;
	case 4:
		prescaler_bits = 0b001;
		break;
	case 8:
		prescaler_bits = 0b010;
		break;
	case 16:
		prescaler_bits = 0b011;
		break;
	case 32:
		prescaler_bits = 0b100;
		break;
	case 64:
		prescaler_bits = 0b101;
		break;
	case 128:
		prescaler_bits = 0b110;
		break;
	case 256:
		prescaler_bits = 0b111;
		break;
	default:
		return; // Invalid prescaler value, exit the function
}


// Enable RCC clock and configure GPIOs based on SPI selection
if (spi == 1) {
	RCC->APB2ENR|= (1 << 12); // Enable SPI1 clock (Bit 12 of APB2ENR)
	Config_GPIO(portA, 5, output_50Mhz, af_pp_output); // PA5: SPI1_SCK
	Config_GPIO(portA, 6, input, pp_in);              // PA6: SPI1_MISO
	Config_GPIO(portA, 7, output_50Mhz, af_pp_output); // PA7: SPI1_MOSI
	Config_GPIO(portA, 4, output_50Mhz, gp_output); // PA4: Chip Select (CS)
		
	SPI1->CR1 |= (1 << 2) | (1 << 8) | (1 << 9);  // 0x4 (MSTR) + 0x100 (SSM) + 0x200 (SSI)
	SPI1->CR1 |= (prescaler_bits<<3); // Prescaler
	SPI1->CR2 |= (1 << 2);                         // SSOE (0x4) if needed
    SPI1->CR1 |= (1 << 6);                         // SPE enable (0x40)
	Write_GPIO (portA, 4, HIGH);
} 
else if (spi == 2) {
	RCC->APB1ENR |= (1 << 14); // Enable SPI2 clock (Bit 14 of APB1ENR)
	Config_GPIO(portB, 13, output_50Mhz, af_pp_output); // PB13: SPI2_SCK
	Config_GPIO(portB, 14, input, pp_in);               // PB14: SPI2_MISO
	Config_GPIO(portB, 15, output_50Mhz, af_pp_output); // PB15: SPI2_MOSI
	Config_GPIO(portB, 12, output_50Mhz, gp_output); // PB12: Chip Select (CS)
		
	SPI2->CR1 |= (1 << 2) | (1 << 8) | (1 << 9);  // MSTR + SSM + SSI
	SPI2->CR1 |= (prescaler_bits << 3);
	SPI2->CR2 |= (1 << 2);
	SPI2->CR1 |= (1 << 6);
	Write_GPIO (portB, 12, HIGH);
} 
else {
	return; // Invalid SPI number, exit the function
}


}

//Simplex transmit
void spi_transmit(uint8_t spi, char tx_char) {
if (spi ==1){
	Write_GPIO (portA, 4, LOW);
	SPI1->DR = tx_char;
	while (!(SPI1->SR & (1 << 1))) {} ;  // Wait for TX buffer empty (TXE=1)
    while (SPI1->SR & (1 << 7)) {} ;     // Wait until not busy (BSY=0)    
	Write_GPIO (portA, 4, HIGH);
 }
 else if (spi ==2){
	Write_GPIO (portB, 12, LOW);
	 SPI2->DR = tx_char;
	 while (!(SPI2->SR & (1 << 1))) {} ;  // TXE check
	 while (SPI2->SR & (1 << 7)) {} ;     // BSY check
	 Write_GPIO (portB, 12, HIGH);
 }   
}

void spi_send_message (uint8_t spi, char message[]){
int i = 0;
if (spi ==1){
	Write_GPIO (portA, 4, LOW);
	while (message[i]) {
		SPI1->DR = message[i];
		while (!(SPI1->SR & (1 << 1))) {} ;  //  TXE check
		while (SPI1->SR & (1 << 7)) {} ;     //  BSY check
		i++;
	}
	Write_GPIO (portA, 4, HIGH);
}

else if (spi ==2){
	Write_GPIO (portB, 12, LOW);
	while (message[i]) {
		SPI2->DR = message[i];
		while (!(SPI2->SR & (1 << 1))) {} ;  //  TXE
		while (SPI2->SR & (1 << 7)) {} ;     //  BSY
		i++;
	}
	Write_GPIO (portB, 12, HIGH);
}
}


// Simplex Receive
uint8_t spi_receive_simplex(uint8_t spi) {
    uint8_t rx_data = 0;
    if (spi == 1) {
        Write_GPIO(portA, 4, LOW);      // CS Low
        SPI1->DR = 0xFF;                // Dummy byte to generate clock
        while (!(SPI1->SR & (1 << 1))){}; // Wait for TX buffer empty (TXE)
        while (SPI1->SR & (1 << 7)){} ;  // Wait until not busy (BSY)
        rx_data = SPI1->DR;             // Read received data
        Write_GPIO(portA, 4, HIGH);     // CS High
    } 
	
