hanifeee535/FreeRTOS_Project/003_LED_Effect_Using_SW_Timer_and_USART/Drivers/stm32f103Driver.c
    else if (spi == 2) {
        Write_GPIO(portB, 12, LOW);
        SPI2->DR = 0xFF;
        while (!(SPI2->SR & (1 << 1))){}
        while (SPI2->SR & (1 << 7)){}
        rx_data = SPI2->DR;
        Write_GPIO(portB, 12, HIGH);
    }
    return rx_data;
}

//Full-Duplex Transmit & Receive
uint8_t spi_transmit_receive_duplex(uint8_t spi, uint8_t tx_data) {
    uint8_t rx_data = 0;
    if (spi == 1) {
        Write_GPIO(portA, 4, LOW);      // CS Low
        SPI1->DR = tx_data;             // Send command/address
		while (!(SPI1->SR & (1 << 1))){} // Wait for TXE
        while (SPI1->SR & (1 << 7)){}   // Wait for BSY
        rx_data = SPI1->DR;             // Read response
        Write_GPIO(portA, 4, HIGH);     // CS High
    } 
    else if (spi == 2) {
        Write_GPIO(portB, 12, LOW);
        SPI2->DR = tx_data;
        while (!(SPI2->SR & (1 << 1))){}
        while (SPI2->SR & (1 << 7)){}
        rx_data = SPI2->DR;
        Write_GPIO(portB, 12, HIGH);
    }
    return rx_data;
}



/*************************************************************************************************/
/*************************__I2C__*************************/
/*************************************************************************************************/
/*
I2C2
PB10 -> SCL  // Clock line for I2C2
PB11 -> SDA  // Data line for I2C2

I2C1
PB6 -> SCL   // Clock line for I2C1
PB7 -> SDA   // Data line for I2C1
*/


I2C_TypeDef* select_I2C(uint8_t i2c) {
    switch (i2c) {
        case 1:
            return I2C1;  // Return I2C1 if i2c == 1
        case 2:
            return I2C2;  // Return I2C2 if i2c == 2
        default:
            return 0;     // Return NULL if i2c is invalid (not 1 or 2)
    }
}


void i2c_init ( uint8_t i2c, uint8_t speed ){
	// Enable the Alternate Function clock (needed for GPIO alternate functions)
	RCC->APB2ENR |= (1<<0);
	
	//Selecting the i2c
	I2C_TypeDef *I2CX =  select_I2C(i2c);
	
	// Enable the clocks for I2C1
	if (i2c == 1) { 
	RCC->APB1ENR |= (1<< 21);
	Config_GPIO (portB,6, output_50Mhz, af_od_output);
	Config_GPIO (portB,7, output_50Mhz, af_od_output);
	
	}
	else if (i2c == 2) { 
	RCC->APB1ENR |= (1<< 22) ;
	Config_GPIO (portB,6, output_50Mhz, af_od_output);
	Config_GPIO (portB,7, output_50Mhz, af_od_output);
	}
	
	//configuring the i2c
	/* When set, the I2C is under reset state. Before resetting this bit, make sure the I2C lines are 
   released and the bus is free. */
	I2CX->CR1 |= (1<<15); //enabling i2c reset
	I2CX->CR1 &= ~ (unsigned) (1<<15); 
	
	I2CX->CR2 = 0x8; // Set peripheral clock frequency to 36 MHz
	I2CX->CCR = speed; // Set speed (fast mode or standard mode) using CCR register
	I2CX -> TRISE = 0x9; // Configure maximum rise time
	I2CX -> CR1 |= (1<<0); // Enable the I2C2 peripheral
	
}

//i2c start bit set
void i2c_start (uint8_t i2c){
	if (i2c ==1){
		I2C1->CR1 |= (1<<8);  // Set the START bit
		while (!(I2C1->SR1 & 1)){}; // Wait for the SB flag to be set
	}
	else if (i2c ==2){
		I2C2->CR1 |= (1<<8);  // Set the START bit
		while (!(I2C2->SR1 & 1)){}; // Wait for the SB flag to be set
	}
}

//i2c adddress sending and read/write command
void i2c_send_address(uint8_t i2c, char address, uint8_t R_W ){
	//volatile uint32_t temp = 0;
	//Selecting the i2c
	I2C_TypeDef *I2CX =  select_I2C(i2c);
	I2CX->DR = (address | R_W); // Write slave address + R/W bit 
	while ((I2CX->SR1 & 2) ==0){}; // Wait for ADDR flag (Address Sent flag to be 1)
	while ((I2CX->SR1 & 2)) {
		/*Reading SR1 and SR2 is the hardware's way of ensuring that the CPU acknowledges the address phase is complete. */
		 I2CX->SR1;
		 I2CX->SR2; 
		if ((I2CX->SR1 & 2) == 0){ break;}
	}
	
}

//send i2c data
void i2c_send_data (uint8_t i2c, char data) {
	if (i2c==1) {
		while ((I2C1->SR1 & 0x80) == 0) {} // Wait until the I2C1 Data Register (DR) is empty (TXE = 1)
		I2C1->DR = data;
		while ((I2C1->SR1 & 0x80)==0) {}  // Wait until the data has been transferred (TXE = 1, meaning data is sent)
	}
	else if (i2c==2) {
		while ((I2C2->SR1 & 0x80) == 0) {} // Wait until the I2C1 Data Register (DR) is empty (TXE = 1)
		I2C2->DR = data;
		while ((I2C2->SR1 & 0x80)==0) {}  // Wait until the data has been transferred (TXE = 1, meaning data is sent)
	}
}

void i2c_stop (uint8_t i2c) {
	//volatile int tmp = 0;
	 if(i2c == 1)
    {
        I2C1->SR1;  // Read SR1 to clear any flags
         I2C1->SR2;  // Read SR2 to clear any flags

        I2C1->CR1 |= 0x200;  // Set the STOP bit to generate a STOP condition
    }
    else if(i2c == 2)
    {
        I2C2->SR1;  // Read SR1 to clear any flags
        I2C2->SR2;  // Read SR2 to clear any flags

        I2C2->CR1 |= 0x200;  // Set the STOP bit to generate a STOP condition
    }
	
}

//i2c write function: 
void i2c_write (uint8_t i2c, uint8_t address, char data []) {
	int i = 0;
	i2c_start (i2c);
	i2c_send_address (i2c, address, 0);
	while (data[i] != '\0'){
		i2c_send_data (i2c, data[1]);
		i++;
	}
	i2c_stop (i2c);

}



/*************************************************************************************************/
/*************************__ADC__*************************/
/*************************************************************************************************/
uint8_t get_adc_channel (uint8_t port, uint8_t pin ){
	uint8_t channel = -1; 
	if (port == portA){
		if(pin <= 7){  //PA0 to PA7
			channel = pin; //ADC_IN0 to ADC_IN7
		}
		else {return -1;}
	}

	else if (port == portB){
		if(pin <= 1){  //PB0 to PB1
			channel = 8+pin; //ADC_IN8 to ADC_IN9
		}
		else {return -1;}
	}

	else if (port == portC){
		if(pin <= 5){  //PC0 to PC5
			channel = 10+pin; //ADC_IN10 to ADC_IN15
		}
		else {return -1;}
	}

	return channel;


}

ADC_TypeDef* select_ADC (uint8_t adc){
	if(adc == 1){
		return ADC1;
	}
	else if (adc == 2){
		return ADC2;
	}
	else {
		return 0;
	}
}

void adc_init (uint8_t adc, uint8_t port, uint8_t pin){
	Config_GPIO(port, pin, input, analog_in ); //configuring pin for analog input
	ADC_TypeDef *adcx = select_ADC(adc);
	uint8_t channel = get_adc_channel(port, pin);
	if (adc == 1){
		RCC->APB2ENR |= (1<<9);
	}
	else if (adc == 2){
		RCC->APB2ENR |= (1<<10);
	}

	adcx->CR2 = 0x0; //reset the adc control register
	adcx->SQR3= channel;
	adcx->CR2 |= 1; //Adc on
	Delay_Sys_MS(100); //wait for sometime because Conversion starts when this bit holds a value of 1 and a 1 is written to it
	adcx->CR2 |= 1; //Adc on
	adcx->CR2 |= 2; //Adc continous mode
}


