hanifeee535/FreeRTOS_Project/003_LED_Effect_Using_SW_Timer_and_USART/Drivers/stm32f103Driver.c
//Checking the ADC data ready flag
uint8_t adc_data_ready(uint8_t adc){
	uint8_t ready = 0; 
	if (adc == 1){
		if (ADC1->SR & 2){
			ready = 1;
		}
		else {ready = 0;}
	}

	else if (adc == 2){
		if (ADC2->SR & 2){
			ready = 1;
		}
		else {ready = 0;}
	}

	else {ready = 0;}

	return ready;
	
}

//reading ADC value 
uint16_t adc_read (uint8_t adc){
	uint16_t adc_data ;
	if (adc == 1){
		adc_data = ADC1->DR;
		
	}
	else if (adc == 2){
		adc_data = ADC2->DR;
	}
	else {adc_data= 0;}
	return adc_data;

}


/*ADC data processing description:

by default right aligned data
which means bit 15 to 12 is zero and bit 11 to 0 will held the actual data
adc has 12 bit resolution. so the value will be 0 to 4095
By default the adc data is 12 bit unsigned integer stored in the 
lower 12 bits of ADC_DR

voltage conversion:

Analog voltage = (ADC_value X Vref)/4095
gere vref is typically the supply voltage unless an external reference is used

So we can se that to convert the data into voltage, we have to do floating point 
calculation. As cortex m3 mcu does not have any dedicated floating point hardware
the mcu will be slower when it has to calculate the floating points.
So there may have several solution for processing the data. We can use 
them according to our needs:
1. floating point: float voltage = (adc_value * 3.3f) / 4095;  
2. Integer scalling to millivolts: uint16_t voltage_mV = (adc_value * 3300) / 4095;  
3. Fixed point: 
		// Fixed-point scaling: 3300/4095 ≈ 0.80586 ≈ 52812 in 16.16 fixed-point
		#define SCALE_FACTOR 52812 // (0.80586 * 65536) ≈ 52812
		uint16_t adc_value = ...;
		uint32_t voltage_mV = (adc_value * SCALE_FACTOR) >> 16; // Shift right 16 bits


**floating point calculation gives exact accuracy, it takes around 100 to 200 cycles to calculate data. Ram usage is low
** Integer scalling and division has also exact accurate value. It takes 50 to 100 clock cycle because of division. It's ram usage is low
** fixed point and bit shifting has data error of around 0.1%. But it takes 5 to 10 clock cycles. So it is faster. 
We can use different method according to our case. 


*/


/*************************************************************************************************/
/*************************__Some_Helper_Function__*************************/
/*************************************************************************************************/

//converting integer number to character string
void int_to_str(int16_t num, char buffer[]) {
    uint8_t idx = 0;
    int is_negative = 0;

    // Handle zero
    if (num == 0) {
        buffer[0] = '0';
        buffer[1] = '\0';
        return;
    }

    // Handle negative numbers
    if (num < 0) {
        is_negative = 1;
        num = -num;
    }

    // Convert digits to characters
    while (num > 0) {
        buffer[idx++] = (num % 10) + '0';
        num /= 10;
    }

    // Add minus sign if needed
    if (is_negative) {
        buffer[idx++] = '-';
    }

    // Null-terminate
    buffer[idx] = '\0';

    // Reverse the buffer
    for (uint8_t i = 0; i < idx / 2; i++) {
        char temp = buffer[i];
        buffer[i] = buffer[idx - i - 1];
        buffer[idx - i - 1] = temp;
    }
}
